app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 8], ["comment", "Very good movie"], ["user_id", 1], ["movie_id", 9], ["created_at", "2016-04-06 11:37:33.433067"], ["updated_at", "2016-04-06 11:37:33.433067"]]